Revit 2027 API
FabricSheetType Properties
The FabricSheetType type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
CanBeCopied |  Determine if this ElementType can create a copy
(Inherited from ElementType)
CanBeDeleted |  Determine if this ElementType can be deleted
(Inherited from ElementType)
CanBeRenamed |  Determine if this ElementType can be renamed
(Inherited from ElementType)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
FamilyName |  Gets the family name of this element type.
(Inherited from ElementType)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
MajorDirectionWireType |  The id of the FabricWireType to be used in the major direction.
MajorEndOverhang |  The distance from the edge of the sheet to the last wire (measured in the major direction).
MajorLapSpliceLength |  The lap splice length in the major direction.
MajorLayoutPattern |  The layout pattern in the major direction.
MajorNumberOfWires |  The number of wires used in the major direction (includes the first and last wires).
MajorReinforcementArea |  The area of fabric divided by the spacing of the wire in the major direction. This method does not apply to custom fabric sheet
MajorSpacing |  The spacing between the wires in the major direction (not including the overhangs).
MajorStartOverhang |  The distance from the edge of the sheet to the first wire (measured in the major direction).
Material |  The id of the material assigned to wires.
MinorDirectionWireType |  The id of the FabricWireType to be used in the minor direction.
MinorEndOverhang |  The distance from the edge of the sheet to the last wire (measured in the minor direction).
MinorLapSpliceLength |  The lap splice length in the minor direction.
MinorLayoutPattern |  The layout pattern in the minor direction.
MinorNumberOfWires |  The number of wires used in the minor direction (includes the 1st and last wires).
MinorReinforcementArea |  The area of fabric divided by the spacing of the wire in the minor direction. This method does not apply to custom fabric sheet
MinorSpacing |  The spacing between the wires in the minor direction (not including the overhangs).
MinorStartOverhang |  The distance from the edge of the sheet to the first wire (measured in the minor direction).
Name | Set the name for the ElementType.
(Inherited from ElementType)
OverallLength |  The length of the wire sheet (including overhangs) in the major direction.
OverallWidth |  The length of the wire sheet (including overhangs) in the minor direction.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
SheetMass |  The sheet mass.
SheetMassUnit |  The sheet mass per area unit.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace